In [1]:
import pandas as pd
from datetime import datetime

In [3]:
my_year = 2006
my_month = 11
my_day = 6
my_hour = 4
my_min = 1
my_sec = 46

In [4]:
my_date = datetime(my_year,my_month,my_day)

In [5]:
my_date

datetime.datetime(2006, 11, 6, 0, 0)

In [6]:
my_date = datetime(my_year,my_month,my_day,my_hour,my_min,my_sec)

In [7]:
my_date

datetime.datetime(2006, 11, 6, 4, 1, 46)

In [9]:
my_date.hour

4

In [10]:
my_date.month

11

In [11]:
my_date.year

2006

In [27]:
import pandas as pd

In [28]:
myser = pd.Series(['Nov 3, 2000', '2000-01-01', None])

In [34]:
myser = pd.Series(['Nov 3, 2000', '2000-01-01', None])
result = pd.to_datetime(myser, errors='coerce')
print(result)

0   2000-11-03
1          NaT
2          NaT
dtype: datetime64[ns]

In [38]:
print(f"Pandas version: {pd.__version__}")

Pandas version: 2.3.3

In [42]:
obvi_euro_date = '31-12-2000'

In [43]:
pd.to_datetime(obvi_euro_date)

C:\Users\abhib\AppData\Local\Temp\ipykernel_8252\163700324.py:1: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  pd.to_datetime(obvi_euro_date)

Timestamp('2000-12-31 00:00:00')

In [45]:
euro_date = '06-11-2006'
pd.to_datetime(euro_date,dayfirst = True)

Timestamp('2006-11-06 00:00:00')

In [47]:
styled_date = '06--Nov--2006'
pd.to_datetime(styled_date,format = '%d--%b--%Y')

Timestamp('2006-11-06 00:00:00')

In [49]:
strange_date = '17th of july 2006'
pd.to_datetime(strange_date)

Timestamp('2006-07-17 00:00:00')

In [54]:
sales = pd.read_csv('D:\\UNZIP-FOR-NOTEBOOKS-FINAL\\03-Pandas\\RetailSales_BeerWineLiquor.csv')

In [55]:
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [56]:
sales.iloc[0]['DATE']

'1992-01-01'

In [57]:
type(sales.iloc[0]['DATE'])

str

In [58]:
sales['DATE'] = pd.to_datetime(sales['DATE'])

In [59]:
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [60]:
sales.iloc[0]['DATE']

Timestamp('1992-01-01 00:00:00')

In [61]:
type(sales.iloc[0]['DATE'])

pandas._libs.tslibs.timestamps.Timestamp